<para lang="fr"></para><para>Ce produit ou document est prot&eacute;g&eacute; par un copyright et distribu&eacute; avec des licences qui en restreignent l'utilisation, la copie, la distribution, et la d&eacute;compilation. Aucune partie de ce produit ou document ne peut &ecirc;tre reproduite sous aucune forme, par quelque moyen que ce soit, sans l'autorisation pr&eacute;alable et &eacute;crite de Sun et de ses bailleurs de licence, s'il y en a. Le logiciel d&eacute;tenu par des tiers, et qui comprend la technologie relative aux polices de caract&egrave;res, est prot&eacute;g&eacute; par un copyright et licenci&eacute; par des fournisseurs de Sun.</para><para>Des parties de ce produit pourront &ecirc;tre d&eacute;riv&eacute;es du syst&egrave;me Berkeley BSD licenci&eacute;s par l'Universit&eacute; de Californie. UNIX est une marque d&eacute;pos&eacute;e aux Etats-Unis et dans d'autres pays et licenci&eacute;e exclusivement par X/Open Company, Ltd. </para><para>Sun, Sun Microsystems, le logo Sun, docs.sun.com, AnswerBook, AnswerBook2, &fr-sun-trademarks;
 et Solaris sont des marques de fabrique ou des marques d&eacute;pos&eacute;es, de Sun Microsystems, Inc. aux Etats-Unis et dans d'autres pays. Toutes les marques SPARC sont utilis&eacute;es sous licence et sont des marques de fabrique ou des marques d&eacute;pos&eacute;es de SPARC International, Inc. aux Etats-Unis et dans d'autres pays. Les produits portant les marques SPARC sont bas&eacute;s sur une architecture d&eacute;velopp&eacute;e par Sun Microsystems, Inc.&fr-other-trademarks;</para><para>L'interface d'utilisation graphique OPEN LOOK et Sun a &eacute;t&eacute; d&eacute;velopp&eacute;e par Sun Microsystems, Inc. pour ses utilisateurs et licenci&eacute;s. Sun reconna&icirc;t les efforts de pionniers de Xerox pour la recherche et le d&eacute;veloppement du concept des interfaces d'utilisation visuelle ou graphique pour l'industrie de l'informatique. Sun d&eacute;tient une licence non exclusive de Xerox sur l'interface d'utilisation graphique Xerox, cette licence couvrant &eacute;galement les licenci&eacute;s de Sun qui mettent en place l'interface d'utilisation graphique OPEN LOOK et qui en outre se conforment aux licences &eacute;crites de Sun.</para><para>CETTE PUBLICATION EST FOURNIE &ldquo;EN L'ETAT&rdquo; ET AUCUNE GARANTIE, EXPRESSE OU IMPLICITE, N'EST ACCORDEE, Y COMPRIS DES GARANTIES CONCERNANT LA VALEUR MARCHANDE, L'APTITUDE DE LA PUBLICATION A REPONDRE A UNE UTILISATION PARTICULIERE, OU LE FAIT QU'ELLE NE SOIT PAS CONTREFAISANTE DE PRODUIT DE TIERS. CE DENI DE GARANTIE NE S'APPLIQUERAIT PAS, DANS LA MESURE OU IL SERAIT TENU JURIDIQUEMENT NUL ET NON AVENU.</para>