<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html lang="en-US">
<head>
<meta http-equiv="Content-type" content="text/html; charset=iso-8859-1">
<title>Document Information - Solaris Trusted Extensions Administrator's Procedures</title>
<meta name="robots" content="index,follow">
<meta name="robots" content="index,follow">
<meta name="date" content="2009-02-01">
<meta name="collection" content="reference">
<link rel="stylesheet" type="text/css" href="css/elements.css">
<link rel="stylesheet" type="text/css" href="css/indiana.css">
</head>

<body>


<div class="Masthead">
   <div class="MastheadLogo">
      <a href="http://www.opensolaris.org"><img border="0" src="graphics/header.png"></img></a>
   </div>
   <div class="Title">Solaris Trusted Extensions Administrator's Procedures</div>
</div>

<table class="Layout" border="0" cellspacing="0" width="100%">
<tbody>

   <tr valign="top" class="PageControls">
      <td></td>
      <td>
         <table width="100%">
      	   <tr>
      	     <td>
                 <a href="trsoladmproc.html">Previous</a>
             </td>
             <td align="right">
                 <a href="preface-4.html">Next</a>
             </td>
           </tr>
         </table>
      </td>
   </tr>
   
   <tr valign="top">
      <td class="Navigation" width="200px"><div class="onpage">
<p class="toc level1"><a href="">Document Information</a></p>
</div>
<p class="toc level1 tocsp"><a href="preface-4.html">Preface</a></p>
<p class="toc level1 tocsp"><a href="trp-part-1.html">Part&nbsp;I&nbsp;Initial Configuration of Trusted Extensions</a></p>
<p class="toc level2"><a href="ovw-1.html">1.&nbsp;&nbsp;Security Planning for Trusted Extensions</a></p>
<p class="toc level2"><a href="tmap-1.html">2.&nbsp;&nbsp;Configuration Roadmap for Trusted Extensions</a></p>
<p class="toc level2"><a href="startinst-1.html">3.&nbsp;&nbsp;Adding Solaris Trusted Extensions Software to the Solaris OS (Tasks)</a></p>
<p class="toc level2"><a href="txconf-1.html">4.&nbsp;&nbsp;Configuring Trusted Extensions (Tasks)</a></p>
<p class="toc level2"><a href="txldap-1.html">5.&nbsp;&nbsp;Configuring LDAP for Trusted Extensions (Tasks)</a></p>
<p class="toc level2"><a href="headl-1.html">6.&nbsp;&nbsp;Configuring a Headless System With Trusted Extensions (Tasks)</a></p>
<p class="toc level1 tocsp"><a href="trp-part-2.html">Part&nbsp;II&nbsp;Administration of Trusted Extensions</a></p>
<p class="toc level2"><a href="txintro-1.html">7.&nbsp;&nbsp;Trusted Extensions Administration Concepts</a></p>
<p class="toc level2"><a href="txtool-1.html">8.&nbsp;&nbsp;Trusted Extensions Administration Tools</a></p>
<p class="toc level2"><a href="roles-1.html">9.&nbsp;&nbsp;Getting Started as a Trusted Extensions Administrator (Tasks)</a></p>
<p class="toc level2"><a href="secreq-1.html">10.&nbsp;&nbsp;Security Requirements on a Trusted Extensions System (Overview)</a></p>
<p class="toc level2"><a href="commontasks-1.html">11.&nbsp;&nbsp;Administering Security Requirements in Trusted Extensions (Tasks)</a></p>
<p class="toc level2"><a href="useraccts-1.html">12.&nbsp;&nbsp;Users, Rights, and Roles in Trusted Extensions (Overview)</a></p>
<p class="toc level2"><a href="manageusers-1.html">13.&nbsp;&nbsp;Managing Users, Rights, and Roles in Trusted Extensions (Tasks)</a></p>
<p class="toc level2"><a href="remotead-1.html">14.&nbsp;&nbsp;Remote Administration in Trusted Extensions (Tasks)</a></p>
<p class="toc level2"><a href="manageldap-1.html">15.&nbsp;&nbsp;Trusted Extensions and LDAP (Overview)</a></p>
<p class="toc level2"><a href="managezones-1.html">16.&nbsp;&nbsp;Managing Zones in Trusted Extensions (Tasks)</a></p>
<p class="toc level2"><a href="managefiles-1.html">17.&nbsp;&nbsp;Managing and Mounting Files in Trusted Extensions (Tasks)</a></p>
<p class="toc level2"><a href="txnet-1.html">18.&nbsp;&nbsp;Trusted Networking (Overview)</a></p>
<p class="toc level2"><a href="managetnet-1.html">19.&nbsp;&nbsp;Managing Networks in Trusted Extensions (Tasks)</a></p>
<p class="toc level2"><a href="managemail-1.html">20.&nbsp;&nbsp;Multilevel Mail in Trusted Extensions (Overview)</a></p>
<p class="toc level2"><a href="manageprint-1.html">21.&nbsp;&nbsp;Managing Labeled Printing (Tasks)</a></p>
<p class="toc level2"><a href="gentextid-15538.html">22.&nbsp;&nbsp;Devices in Trusted Extensions (Overview)</a></p>
<p class="toc level2"><a href="managedev-1.html">23.&nbsp;&nbsp;Managing Devices for Trusted Extensions (Tasks)</a></p>
<p class="toc level2"><a href="audtask-1.html">24.&nbsp;&nbsp;Trusted Extensions Auditing (Overview)</a></p>
<p class="toc level2"><a href="softmgt-1.html">25.&nbsp;&nbsp;Software Management in Trusted Extensions (Tasks)</a></p>
<p class="toc level1 tocsp"><a href="appol-1.html">A.&nbsp;&nbsp;Site Security Policy</a></p>
<p class="toc level2"><a href="appol-12.html">Creating and Managing a Security Policy</a></p>
<p class="toc level2"><a href="appol-11.html">Site Security Policy and Trusted Extensions</a></p>
<p class="toc level2"><a href="appol-2.html">Computer Security Recommendations</a></p>
<p class="toc level2"><a href="appol-3.html">Physical Security Recommendations</a></p>
<p class="toc level2"><a href="appol-4.html">Personnel Security Recommendations</a></p>
<p class="toc level2"><a href="appol-5.html">Common Security Violations</a></p>
<p class="toc level2"><a href="appol-6.html">Additional Security References</a></p>
<p class="toc level1 tocsp"><a href="aptxconf-1.html">B.&nbsp;&nbsp;Using CDE Actions to Install Zones in Trusted Extensions</a></p>
<p class="toc level2"><a href="aptxconf-62.html">Associating Network Interfaces With Zones by Using CDE Actions (Task Map)</a></p>
<p class="toc level2"><a href="aptxconf-40.html">Preparing to Create Zones by Using CDE Actions (Task Map)</a></p>
<p class="toc level2"><a href="aptxconf-20.html">Creating Labeled Zones by Using CDE Actions (Task Map)</a></p>
<p class="toc level1 tocsp"><a href="checklist-1.html">C.&nbsp;&nbsp;Configuration Checklist for Trusted Extensions</a></p>
<p class="toc level2"><a href="checklist-2.html">Checklist for Configuring Trusted Extensions</a></p>
<p class="toc level1 tocsp"><a href="txapp-1.html">D.&nbsp;&nbsp;Quick Reference to Trusted Extensions Administration</a></p>
<p class="toc level2"><a href="txapp-2.html">Administrative Interfaces in Trusted Extensions</a></p>
<p class="toc level2"><a href="txapp-3.html">Solaris Interfaces Extended by Trusted Extensions</a></p>
<p class="toc level2"><a href="txapp-4.html">Tighter Security Defaults in Trusted Extensions</a></p>
<p class="toc level2"><a href="txapp-5.html">Limited Options in Trusted Extensions</a></p>
<p class="toc level1 tocsp"><a href="txmp-1.html">E.&nbsp;&nbsp;List of Trusted Extensions Man Pages</a></p>
<p class="toc level2"><a href="txmp-2.html">Trusted Extensions Man Pages in Alphabetical Order</a></p>
<p class="toc level2"><a href="txmp-3.html">Solaris Man Pages That Are Modified by Trusted Extensions</a></p>
<p class="toc level1 tocsp"><a href="glossary-1.html">Glossary</a></p>
<p class="toc level1 tocsp"><a href="idx-1.html">Index</a></p>
</td>
      <td class="ContentPane" width="705px">

	 <div class="MainContent">      	 
             <a name="documentinfo"></a><p>Part No: 819-7309-07</p><p>February 2009</p><p>4150 Network Circle<br>Santa Clara,  CA 95054<br>U.S.A.</p><p>Copyright 2009 Sun Microsystems, Inc.</p><p>This
book is intended for the system administrator and the security administrator whose duties
include enabling and configuring Solaris<sup>TM</sup> Trusted Extensions software on a system. This book also
provides procedures for administering labels and programs that are unique to Trusted Extensions.</p><p>Sun
Microsystems, Inc. has intellectual property rights relating to technology embodied in the
product that is described in this document. In particular, and without limitation,
these intellectual property rights may include one or more U.S. patents or pending
patent applications in the U.S. and in other countries.</p><p>U.S. Government Rights &ndash;
Commercial software.  Government users are subject to the Sun Microsystems, Inc.
standard license agreement and applicable provisions of the FAR and its supplements.</p><p>This
distribution may include materials developed by third parties.</p><p>Parts of the product may
be derived from Berkeley BSD systems, licensed from the University of California.
UNIX is a registered trademark in the U.S. and other countries, exclusively licensed
through X/Open Company, Ltd.</p><p>Sun, Sun Microsystems, the Sun logo, the Solaris logo, the
Java Coffee Cup logo, docs.sun.com,   Netra, OpenSolaris, Solaris Management Console, ToolTalk,
Sun Ray, StarOffice,  Java, and Solaris are trademarks or registered trademarks of Sun
Microsystems, Inc. or its subsidiaries in the U.S. and other countries. All SPARC
trademarks are used under license and are trademarks or registered trademarks of SPARC
International, Inc. in the U.S. and other countries. Products bearing SPARC trademarks are
based upon an architecture developed by Sun Microsystems, Inc.   PostScript is a
trademark or registered trademark of Adobe Systems, Incorporated, which may be registered
in certain jurisdictions.</p><p>The OPEN LOOK and Sun<sup>TM</sup> Graphical User Interface was developed
by Sun Microsystems, Inc. for its users and licensees. Sun acknowledges the pioneering
efforts of Xerox in researching and developing the concept of visual or graphical
user interfaces for the computer industry. Sun holds a non-exclusive license from Xerox
to the Xerox Graphical User Interface, which license also covers Sun's licensees who
implement OPEN LOOK GUIs and otherwise comply with Sun's written license agreements.</p><p>Products covered
by and information contained in this publication are controlled by U.S. Export
Control laws and may be subject to the export or import laws in
other countries. Nuclear, missile, chemical or biological weapons or nuclear maritime end uses
or end users, whether direct or indirect, are strictly prohibited. Export or reexport
to countries subject to U.S. embargo or to entities identified on U.S. export
exclusion lists, including, but not limited to, the denied persons and specially designated
nationals lists is strictly prohibited.</p><p>DOCUMENTATION IS PROVIDED &ldquo;AS IS&rdquo; AND ALL EXPRESS OR
IMPLIED CONDITIONS, REPRESENTATIONS AND WARRANTIES, INCLUDING ANY IMPLIED WARRANTY OF MERCHANTABILITY, FITNESS FOR
A PARTICULAR PURPOSE OR NON-INFRINGEMENT, ARE DISCLAIMED, EXCEPT TO THE EXTENT THAT SUCH
DISCLAIMERS ARE HELD TO BE LEGALLY INVALID.</p><p></p><p>Sun Microsystems, Inc. d&eacute;tient les droits
de propri&eacute;t&eacute; intellectuelle relatifs &agrave; la technologie incorpor&eacute;e dans le produit qui est d&eacute;crit dans
ce document. En particulier, et ce sans limitation, ces droits de propri&eacute;t&eacute; intellectuelle peuvent
inclure un ou plusieurs brevets am&eacute;ricains ou des applications de brevet en attente aux
Etats-Unis et dans d'autres pays.</p><p>Cette distribution peut comprendre des composants d&eacute;velopp&eacute;s par des tierces
personnes.</p><p>Certaines composants de ce produit peuvent &ecirc;tre d&eacute;riv&eacute;es du logiciel Berkeley BSD, licenci&eacute;s
par l'Universit&eacute; de Californie. UNIX est une marque d&eacute;pos&eacute;e aux Etats-Unis et dans d'autres pays;
elle est licenci&eacute;e exclusivement par X/Open Company, Ltd. </p><p>Sun, Sun Microsystems, le logo
Sun, le logo Solaris, le logo Java Coffee Cup, docs.sun.com,   Netra, OpenSolaris,
Solaris Management Console, ToolTalk, Sun Ray, StarOffice,   Java et Solaris sont
des marques de fabrique ou des marques d&eacute;pos&eacute;es de Sun Microsystems, Inc., ou ses
filiales, aux Etats-Unis et dans d'autres pays. Toutes les marques SPARC sont utilis&eacute;es sous
licence et sont des marques de fabrique ou des marques d&eacute;pos&eacute;es de SPARC International,
Inc. aux Etats-Unis et dans d'autres pays. Les produits portant les marques SPARC sont
bas&eacute;s sur une architecture d&eacute;velopp&eacute;e par Sun Microsystems, Inc.  PostScript est une marque de
fabrique d'Adobe Systems, Incorporated, laquelle pourrait &eacute;`tre d&eacute;pos&eacute;e dans certaines juridictions.</p><p>L'interface d'utilisation
graphique OPEN LOOK et Sun a &eacute;t&eacute; d&eacute;velopp&eacute;e par Sun Microsystems, Inc. pour ses utilisateurs
et licenci&eacute;s. Sun reconna&icirc;t les efforts de pionniers de Xerox pour la recherche et le
d&eacute;veloppement du concept des interfaces d'utilisation visuelle ou graphique pour l'industrie de l'informatique. Sun d&eacute;tient
une licence non exclusive de Xerox sur l'interface d'utilisation graphique Xerox, cette licence
couvrant &eacute;galement les licenci&eacute;s de Sun qui mettent en place l'interface d'utilisation graphique OPEN LOOK
et qui, en outre, se conforment aux licences &eacute;crites de Sun.</p><p>Les produits qui
font l'objet de cette publication et les informations qu'il contient sont r&eacute;gis par
la legislation am&eacute;ricaine en mati&egrave;re de contr&ocirc;le des exportations et peuvent &ecirc;tre soumis
au droit d'autres pays dans le domaine des exportations et importations. Les utilisations
finales, ou utilisateurs finaux, pour des armes nucl&eacute;aires, des missiles, des armes chimiques ou
biologiques ou pour le nucl&eacute;aire maritime, directement ou indirectement, sont strictement interdites. Les
exportations ou r&eacute;exportations vers des pays sous embargo des Etats-Unis, ou vers des
entit&eacute;s figurant sur les listes d'exclusion d'exportation am&eacute;ricaines, y compris, mais de mani&egrave;re
non exclusive, la liste de personnes qui font objet d'un ordre de ne
pas participer, d'une fa&ccedil;on directe ou indirecte, aux exportations des produits ou des services
qui sont r&eacute;gis par la legislation am&eacute;ricaine en mati&egrave;re de contr&ocirc;le des exportations et la liste
de ressortissants sp&eacute;cifiquement design&eacute;s, sont rigoureusement interdites.</p><p>LA DOCUMENTATION EST FOURNIE "EN L'ETAT" ET
TOUTES AUTRES CONDITIONS, DECLARATIONS ET GARANTIES EXPRESSES OU TACITES SONT FORMELLEMENT EXCLUES, DANS LA
MESURE AUTORISEE PAR LA LOI APPLICABLE, Y COMPRIS NOTAMMENT TOUTE GARANTIE IMPLICITE RELATIVE
A LA QUALITE MARCHANDE, A L'APTITUDE A UNE UTILISATION PARTICULIERE OU A L'ABSENCE
DE CONTREFACON. </p>Desktop &amp; Window SystemsInstallation &amp; SetupSecuritySystem Administration
         </div>
      </td>
   </tr>

   <tr class="PageControls" valign="top">
      <td></td>
      <td>
         <table width="100%">
      	   <tr>
      	     <td>
                 <a href="trsoladmproc.html">Previous</a>
             </td>
             <td align="right">
                 <a href="preface-4.html">Next</a>
             </td>
           </tr>
         </table>
      </td>
   </tr>
</tbody>
</table>


</body>
</html>

